tests/mutations/event-has-no-producers.patch
diff --git a/src/FlowX.Compiler/Emit/ManifestWriter.cs b/src/FlowX.Compiler/Emit/ManifestWriter.cs
--- a/src/FlowX.Compiler/Emit/ManifestWriter.cs
+++ b/src/FlowX.Compiler/Emit/ManifestWriter.cs
@@ -991,7 +991,7 @@
             .OrderBy(id => id, System.StringComparer.Ordinal)
             .ToList();
 
-        if (producers.Count == 0)
+        if (producers.Count <= 1)
         {
             return;
         }
